import pandas as pd

# 创建Series
index = ['2019/3/23','2019/3/24','2019/3/25','2019/3/26','2019/3/27',
         '2019/3/28','2019/3/29','2019/3/30','2019/3/31','2019/4/1',
         '2019/4/2','2019/4/3','2019/4/4'] # 索引
value = [18,20,19,20,18,15,17,19,20,15,18,15,20] # 值
s = pd.Series(data=value,index=index) # 创建Series
print(s) # 打印Series

# 创建DataFrame
df = pd.DataFrame(data={
    '学号': ['x1','x2','x3','x4','x5'],
    '姓名': ['张三','李四','王五','韩六','赵七'],
    '身高': [177,151,167,175,153],
    '语文成绩': [92,84,80,77,87],
    '学分': [1.5,2.3,3.2,1.2,1.8],
    '日期': ['2019/3/23','2019/3/24','2019/3/25','2019/3/26','2019/3/27']
})
print(df) # 打印DataFrame

# 嵌套字典创建DataFrame
df = pd.DataFrame(data=[
    ['x1','张三',177,92,1.5,'2019/3/23'],
    ['x2','李四',151,84,2.3,'2019/3/24'],
    ['x3','王五',167,80,3.2,'2019/3/25'],
    ['x4','韩六',175,77,1.2,'2019/3/26'],
    ['x5','赵七',153,87,1.8,'2019/3/27']
],columns=['学号','姓名','身高','语文成绩','学分','日期'])
print(df) # 打印DataFrame

# 统计函数
print('dataframe的维度: ',df.shape) # 统计dataframe的维度
